{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "name": "Lookinglass Frequently Asked Questions",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "Why pay-as-you-go instead of subscriptions?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "We believe in subscription fatigue relief. Instead of paying $20-200/month whether you use AI or not, you only pay for the messages you actually send. Top up your wallet with amounts from $1-500, use what you need, keep the rest. Many users spend less than $5/month this way."
      }
    },
    {
      "@type": "Question",
      "name": "How much does it typically cost to use?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Costs vary by model and message length, but here are some examples:\n\nSimple questions (gpt-4o-mini): $0.001-0.01 per message\nComplex reasoning (o3): $0.01-0.10 per message\nPremium reasoning (o3-pro): $0.05-0.50 for complex tasks\n\nThe app shows you the exact cost before sending each message, so there are never surprises."
      }
    },
    {
      "@type": "Question",
      "name": "What happens to unused wallet funds?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Your wallet funds never expire and are non-refundable. You can use them whenever you want, even months later. There are no monthly fees or account maintenance charges."
      }
    },
    {
      "@type": "Question",
      "name": "Can I get a refund on wallet funds?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Wallet funds are non-refundable once added, as stated in our terms. However, they never expire, so you can use them whenever you're ready."
      }
    },
    {
      "@type": "Question",
      "name": "Why would I pay when ChatGPT is free?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "You probably shouldn't—if free ChatGPT's limitations work for you.\n\nChatGPT Free tier gives you:\n- 10 messages every 5 hours with gpt-5\n- 1 gpt-5 Thinking message per day\n- 16K context window (about 12,000 words)\n- Automatic downgrades: After limits, switches to mini version without notification\n- No visibility: Can't see which model you're using or how much capacity remains\n\nChatGPT Plus ($20/month) gives you:\n- 160 messages every 3 hours with gpt-5\n- 3,000 gpt-5 Thinking messages per week\n- 32K context window (about 24,000 words)\n- Model selection: Can manually choose models\n- No pro models: No access to gpt-5-pro, o3-pro, or o1-pro\n\nChatGPT Pro ($200/month) gives you:\n- Unlimited messages (subject to abuse guardrails)\n- 128K context window for Fast mode, 196K for Thinking mode\n- Access to gpt-5-pro\n- No o3-pro or o1-pro: Those remain Enterprise-only\n\nConsider Lookinglass if:\n- You're a light user: Why pay $20-$200/month when you can pay $2-$5/month?\n- You want complete model access: Free tier gives you no selection. Plus ($20/month) gives you some models. Pro ($200/month) still doesn't include everything. Lookinglass gives you all 21 models with no subscription required.\n- You need all pro models: Access o3-pro, o1-pro, AND gpt-5-pro without $200/month subscriptions or enterprise contracts\n- You need context control: Set from 500 tokens to 1M tokens—you decide what the AI remembers\n- Quality consistency matters: Choose your model, get consistent results every time—no surprise downgrades\n- You need transparency: See your balance, costs, model, and tokens before every message\n\nStart with $1 free credit and compare the experience yourself."
      }
    },
    {
      "@type": "Question",
      "name": "Which AI models are included?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Lookinglass provides access to 21 OpenAI models including:\n\nGPT Models: gpt-5, gpt-4.1, gpt-4o, gpt-3.5-turbo, and variants\nO-Series (Reasoning): o1, o1-mini, o3, o3-mini, o4-mini, o3-pro\n\nYou can switch between models mid-conversation based on your needs."
      }
    },
    {
      "@type": "Question",
      "name": "How is this different from ChatGPT?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Transparency & Control: ChatGPT decides which model handles your request and automatically truncates conversation history to manage costs. With Lookinglass, YOU choose the model, YOU control context window size (500 tokens to 1M), and YOU see exactly what you're paying for.\n\nPredictable Quality: ChatGPT routes to different models behind the scenes, so quality varies. Lookinglass gives you the exact model you selected—every time.\n\nFair Pricing: Subscriptions charge the same whether you send 10 messages or 1,000. With Lookinglass, light months cost less, heavy months cost more. Your bill matches your actual usage."
      }
    },
    {
      "@type": "Question",
      "name": "What's special about pro model access?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Lookinglass gives you pay-per-use access to all three pro models: o3-pro, o1-pro, and gpt-5-pro. Why this matters: o3-pro and o1-pro are Enterprise-only at OpenAI (no public pricing, requires sales contact). gpt-5-pro requires ChatGPT Pro ($200/month subscription). Lookinglass is the only way to access all 3 on a pay-per-message basis—no subscriptions, no enterprise contracts. Use pro models for your most important tasks, pay only when you need them."
      }
    },
    {
      "@type": "Question",
      "name": "What is smart savings?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Smart savings saves you 50% on message costs if you're willing to wait a bit longer for responses. It's available on select models (gpt-5 series, o3, o4-mini) and perfect for non-urgent tasks where you want to optimize for cost over speed."
      }
    },
    {
      "@type": "Question",
      "name": "Is my data private and secure?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes. We take privacy seriously:\n\nNo conversation storage: We don't store your messages or AI responses\nMinimal metadata: Only billing and basic usage info is kept\nApple Sign-In: Secure authentication without exposing personal data\nGuest mode: Use completely anonymously if preferred"
      }
    },
    {
      "@type": "Question",
      "name": "What information do you collect?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "We collect minimal data for billing and app functionality:\n\nWhich model you used and when\nToken counts for accurate billing\nBasic account info (if you sign in with Apple)\n\nWe never see your actual conversations or prompts."
      }
    },
    {
      "@type": "Question",
      "name": "What is \"permanent memory\" and how does it work?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Permanent memory lets you tell the AI key information about yourself once, and it remembers across all conversations. For example: \"I'm a Python developer working on iOS apps.\" This context gets included automatically, so you don't need to re-explain your background each time."
      }
    },
    {
      "@type": "Question",
      "name": "Can I control how much the AI remembers?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Absolutely! You have full control over smart memory (context window):\n\nToggle on/off: Enable or disable conversation history entirely\nWhen enabled: Set from 500 tokens (minimum) up to your model's maximum context\nAdjustable in 500-token increments: Fine-tune exactly how much history the AI remembers\nResponse length control: Set output tokens from 100 (minimum) in 100-token increments\n\nMore context costs more but provides better continuity."
      }
    },
    {
      "@type": "Question",
      "name": "What is spending protection?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Spending protection alerts you before sending messages that exceed your chosen threshold. Enable spending alerts in settings, set your preferred threshold (like $0.01, $0.10, or any amount), and you'll get a warning before accidentally sending an expensive message."
      }
    },
    {
      "@type": "Question",
      "name": "Can I use voice input?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes! Lookinglass includes built-in voice-to-text, so you can speak your questions naturally instead of typing them."
      }
    },
    {
      "@type": "Question",
      "name": "Is the app free to download?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, Lookinglass is completely free to download. You only pay for the AI messages you actually send."
      }
    },
    {
      "@type": "Question",
      "name": "Do I need to create an account?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Not required! You can use guest mode for complete anonymity. However, signing in with Apple allows you to:\n\nAccess your wallet and transaction history across devices\nUse permanent memory features\nSave conversation threads"
      }
    },
    {
      "@type": "Question",
      "name": "What's the minimum amount I can add to my wallet?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Just $1! You can amounts from $1 to $500. Most casual users start with $5 or $10 to try it out."
      }
    },
    {
      "@type": "Question",
      "name": "Is there an onboarding tutorial?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes! The app includes an interactive tutorial that explains all the features. You can access it anytime from Settings if you want a refresher."
      }
    },
    {
      "@type": "Question",
      "name": "Which devices are supported?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Lookinglass works on iPhone and iPad running iOS 15 or later. It's designed exclusively for Apple devices."
      }
    },
    {
      "@type": "Question",
      "name": "Does it work offline?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "No, Lookinglass requires an internet connection to communicate with AI models. However, your conversation history and settings are stored locally when possible."
      }
    },
    {
      "@type": "Question",
      "name": "Can I export my conversation history?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "You can export your transaction history and usage data as CSV files. Individual conversations aren't stored on our servers for privacy, but you can copy/save them locally within the app."
      }
    }
  ]
}